micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Src/stm32n6xx_ll_dma.c
/**
  ******************************************************************************
  * @file    stm32n6xx_ll_dma.c
  * @author  MCD Application Team
  * @brief   DMA LL module driver.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
 @verbatim
  ==============================================================================
                        ##### LL DMA driver acronyms #####
  ==============================================================================
  [..]  Acronyms table :
                   =========================================
                   || Acronym ||                          ||
                   =========================================
                   || SRC     ||  Source                  ||
                   || DEST    ||  Destination             ||
                   || ADDR    ||  Address                 ||
                   || ADDRS   ||  Addresses               ||
                   || INC     ||  Increment / Incremented ||
                   || DEC     ||  Decrement / Decremented ||
                   || BLK     ||  Block                   ||
                   || RPT     ||  Repeat / Repeated       ||
                   || TRIG    ||  Trigger                 ||
                   =========================================
 @endverbatim
  ******************************************************************************
  */

#if defined (USE_FULL_LL_DRIVER)

/* Includes ------------------------------------------------------------------*/
#include "stm32n6xx_ll_dma.h"
#include "stm32n6xx_ll_bus.h"
#ifdef  USE_FULL_ASSERT
#include "stm32_assert.h"
#else
#define assert_param(expr) ((void)0U)
#endif /* USE_FULL_ASSERT */

/** @addtogroup STM32N6xx_LL_Driver
  * @{
  */

#if (defined (GPDMA1) || defined (HPDMA1))

/** @addtogroup DMA_LL
  * @{
  */

/* Private types -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private constants ---------------------------------------------------------*/
/* Private macros ------------------------------------------------------------*/

/** @addtogroup DMA_LL_Private_Macros
  * @{
  */
#define IS_LL_DMA_ALL_CHANNEL_INSTANCE(INSTANCE, Channel) ((((INSTANCE) == HPDMA1)                && \
                                                            (((Channel)  == LL_DMA_CHANNEL_0)     || \
                                                             ((Channel)  == LL_DMA_CHANNEL_1)     || \
                                                             ((Channel)  == LL_DMA_CHANNEL_2)     || \
                                                             ((Channel)  == LL_DMA_CHANNEL_3)     || \
                                                             ((Channel)  == LL_DMA_CHANNEL_4)     || \
                                                             ((Channel)  == LL_DMA_CHANNEL_5)     || \
                                                             ((Channel)  == LL_DMA_CHANNEL_6)     || \
                                                             ((Channel)  == LL_DMA_CHANNEL_7)     || \
                                                             ((Channel)  == LL_DMA_CHANNEL_8)     || \
                                                             ((Channel)  == LL_DMA_CHANNEL_9)     || \
                                                             ((Channel)  == LL_DMA_CHANNEL_10)    || \
                                                             ((Channel)  == LL_DMA_CHANNEL_11)    || \
                                                             ((Channel)  == LL_DMA_CHANNEL_12)    || \
                                                             ((Channel)  == LL_DMA_CHANNEL_13)    || \
                                                             ((Channel)  == LL_DMA_CHANNEL_14)    || \
                                                             ((Channel)  == LL_DMA_CHANNEL_15)    || \
                                                             ((Channel)  == LL_DMA_CHANNEL_ALL))) || \
                                                           (((INSTANCE) == GPDMA1)                && \
                                                            (((Channel)  == LL_DMA_CHANNEL_0)     || \
                                                             ((Channel)  == LL_DMA_CHANNEL_1)     || \
                                                             ((Channel)  == LL_DMA_CHANNEL_2)     || \
                                                             ((Channel)  == LL_DMA_CHANNEL_3)     || \
                                                             ((Channel)  == LL_DMA_CHANNEL_4)     || \
                                                             ((Channel)  == LL_DMA_CHANNEL_5)     || \
                                                             ((Channel)  == LL_DMA_CHANNEL_6)     || \
                                                             ((Channel)  == LL_DMA_CHANNEL_7)     || \
                                                             ((Channel)  == LL_DMA_CHANNEL_8)     || \
                                                             ((Channel)  == LL_DMA_CHANNEL_9)     || \
                                                             ((Channel)  == LL_DMA_CHANNEL_10)    || \
                                                             ((Channel)  == LL_DMA_CHANNEL_11)    || \
                                                             ((Channel)  == LL_DMA_CHANNEL_12)    || \
                                                             ((Channel)  == LL_DMA_CHANNEL_13)    || \
                                                             ((Channel)  == LL_DMA_CHANNEL_14)    || \
                                                             ((Channel)  == LL_DMA_CHANNEL_15)    || \
                                                             ((Channel)  == LL_DMA_CHANNEL_ALL))))

#define IS_LL_HPDMA_CHANNEL_INSTANCE(INSTANCE, Channel)   (((INSTANCE) == HPDMA1)                && \
                                                           (((Channel)  == LL_DMA_CHANNEL_0)     || \
                                                            ((Channel)  == LL_DMA_CHANNEL_1)     || \
                                                            ((Channel)  == LL_DMA_CHANNEL_2)     || \
                                                            ((Channel)  == LL_DMA_CHANNEL_3)     || \
                                                            ((Channel)  == LL_DMA_CHANNEL_4)     || \
                                                            ((Channel)  == LL_DMA_CHANNEL_5)     || \
                                                            ((Channel)  == LL_DMA_CHANNEL_6)     || \
                                                            ((Channel)  == LL_DMA_CHANNEL_7)     || \
                                                            ((Channel)  == LL_DMA_CHANNEL_8)     || \
                                                            ((Channel)  == LL_DMA_CHANNEL_9)     || \
                                                            ((Channel)  == LL_DMA_CHANNEL_10)    || \
                                                            ((Channel)  == LL_DMA_CHANNEL_11)    || \
                                                            ((Channel)  == LL_DMA_CHANNEL_12)    || \
                                                            ((Channel)  == LL_DMA_CHANNEL_13)    || \
                                                            ((Channel)  == LL_DMA_CHANNEL_14)    || \
                                                            ((Channel)  == LL_DMA_CHANNEL_15)))

#define IS_LL_GPDMA_CHANNEL_INSTANCE(INSTANCE, Channel)   (((INSTANCE) == GPDMA1)                && \
                                                           (((Channel)  == LL_DMA_CHANNEL_0)     || \
                                                            ((Channel)  == LL_DMA_CHANNEL_1)     || \
                                                            ((Channel)  == LL_DMA_CHANNEL_2)     || \
                                                            ((Channel)  == LL_DMA_CHANNEL_3)     || \
                                                            ((Channel)  == LL_DMA_CHANNEL_4)     || \
                                                            ((Channel)  == LL_DMA_CHANNEL_5)     || \
                                                            ((Channel)  == LL_DMA_CHANNEL_6)     || \
                                                            ((Channel)  == LL_DMA_CHANNEL_7)     || \
                                                            ((Channel)  == LL_DMA_CHANNEL_8)     || \
                                                            ((Channel)  == LL_DMA_CHANNEL_9)     || \
                                                            ((Channel)  == LL_DMA_CHANNEL_10)    || \
                                                            ((Channel)  == LL_DMA_CHANNEL_11)    || \
                                                            ((Channel)  == LL_DMA_CHANNEL_12)    || \
                                                            ((Channel)  == LL_DMA_CHANNEL_13)    || \
                                                            ((Channel)  == LL_DMA_CHANNEL_14)    || \
                                                            ((Channel)  == LL_DMA_CHANNEL_15)))

#define IS_LL_DMA_2D_CHANNEL_INSTANCE(INSTANCE, Channel)  ((((INSTANCE) == HPDMA1)                && \
                                                            (((Channel)  == LL_DMA_CHANNEL_12)    || \
                                                             ((Channel)  == LL_DMA_CHANNEL_13)    || \
                                                             ((Channel)  == LL_DMA_CHANNEL_14)    || \
                                                             ((Channel)  == LL_DMA_CHANNEL_15)))  || \
                                                           (((INSTANCE) == GPDMA1)                && \
                                                            (((Channel)  == LL_DMA_CHANNEL_12)    || \
                                                             ((Channel)  == LL_DMA_CHANNEL_13)    || \
                                                             ((Channel)  == LL_DMA_CHANNEL_14)    || \
                                                             ((Channel)  == LL_DMA_CHANNEL_15))))

#define IS_LL_DMA_MODE(__VALUE__)                         (((__VALUE__) == LL_DMA_NORMAL) || \
                                                           ((__VALUE__) == LL_DMA_PFCTRL))

#define IS_LL_DMA_PFREQ_INSTANCE(INSTANCE, Channel)       ((((INSTANCE) == HPDMA1)                && \
                                                            (((Channel)  == LL_DMA_CHANNEL_0)     || \
                                                             ((Channel)  == LL_DMA_CHANNEL_1)     || \
                                                             ((Channel)  == LL_DMA_CHANNEL_15)))  || \
                                                           (((INSTANCE) == GPDMA1)                && \
                                                            (((Channel)  == LL_DMA_CHANNEL_0)     || \
                                                             ((Channel)  == LL_DMA_CHANNEL_1)     || \
                                                             ((Channel)  == LL_DMA_CHANNEL_15))))

