micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Src/stm32n6xx_ll_dma.c
  if ((DMA_InitNodeStruct->NodeType & (LL_DMA_HPDMA_2D_NODE | LL_DMA_HPDMA_LINEAR_NODE)) != 0U)
  {
    if (((DMA_InitNodeStruct->SrcAllocatedPort & DMA_CTR1_SAP) == LL_DMA_SRC_ALLOCATED_PORT0) &&
        (DMA_InitNodeStruct->SrcBurstLength > 16U))
    {
      return (uint32_t)ERROR;
    }
    if (((DMA_InitNodeStruct->DestAllocatedPort & DMA_CTR1_DAP) == LL_DMA_DEST_ALLOCATED_PORT0) &&
        (DMA_InitNodeStruct->DestBurstLength > 16U))
    {
      return (uint32_t)ERROR;
    }
  }

  /* Check if CTR1 register update is enabled */
  if ((DMA_InitNodeStruct->UpdateRegisters & LL_DMA_UPDATE_CTR1) == LL_DMA_UPDATE_CTR1)
  {
    /*-------------------------- DMAx CTR1 Configuration -----------------------
    * Configure the Data transfer  parameter :
    * - DestAllocatedPort:                        DMA_CTR1_DAP bit
    * - DestWordExchange:                         DMA_CTR1_DWX bit
    * - DestHWordExchange:                        DMA_CTR1_DHX bit
    * - DestByteExchange:                         DMA_CTR1_DBX bit
    * - DestIncMode:                              DMA_CTR1_DINC bit
    * - DestDataWidth:                            DMA_CTR1_DDW_LOG2 [17:16] bits
    * - SrcAllocatedPort:                         DMA_CTR1_SAP bit
    * - SrcByteExchange:                          DMA_CTR1_SBX bit
    * - DataAlignment:                            DMA_CTR1_PAM [12:11] bits
    * - SrcIncMode:                               DMA_CTR1_SINC bit
    * - SrcDataWidth:                             DMA_CTR1_SDW_LOG2 [1:0] bits
    * - SrcBurstLength:                           DMA_CTR1_SBL_1 [9:4] bits
    * - DestBurstLength:                          DMA_CTR1_DBL_1 [25:20] bits
    */

    pNode->LinkRegisters[reg_counter] = (DMA_InitNodeStruct->DestIncMode   | \
                                         DMA_InitNodeStruct->DestDataWidth | \
                                         DMA_InitNodeStruct->DataAlignment | \
                                         DMA_InitNodeStruct->SrcIncMode    | \
                                         DMA_InitNodeStruct->SrcDataWidth);

#if defined (CPU_IN_SECURE_STATE)
    pNode->LinkRegisters[reg_counter] |= (DMA_InitNodeStruct->DestSecure | \
                                          DMA_InitNodeStruct->SrcSecure);
#endif /* CPU_IN_SECURE_STATE */

    /* Update CTR1 register fields */
    pNode->LinkRegisters[reg_counter] |= (DMA_InitNodeStruct->DestAllocatedPort                              | \
                                          DMA_InitNodeStruct->DestWordExchange                               | \
                                          DMA_InitNodeStruct->DestHWordExchange                              | \
                                          DMA_InitNodeStruct->DestByteExchange                               | \
                                          ((DMA_InitNodeStruct->DestBurstLength - 1U) << DMA_CTR1_DBL_1_Pos) | \
                                          DMA_InitNodeStruct->SrcAllocatedPort                               | \
                                          DMA_InitNodeStruct->SrcByteExchange                                | \
                                          ((DMA_InitNodeStruct->SrcBurstLength - 1U) << DMA_CTR1_SBL_1_Pos));

    /* Increment counter for the next register */
    reg_counter++;
  }


  /* Check if CTR2 register update is enabled */
  if ((DMA_InitNodeStruct->UpdateRegisters & LL_DMA_UPDATE_CTR2) == LL_DMA_UPDATE_CTR2)
  {
    /*-------------------------- DMAx CTR2 Configuration -----------------------
     * Configure the channel transfer parameter :
     * - TransferEventMode:                        DMA_CTR2_TCEM [31:30] bits
     * - TriggerPolarity:                          DMA_CTR2_TRIGPOL [25:24] bits
     * - TriggerMode:                              DMA_CTR2_TRIGM  [15:14] bits
     * - Mode:                                     DMA_CTR2_PFREQ bit
     * - BlkHWRequest:                             DMA_CTR2_BREQ bit
     * - Direction:                                DMA_CTR2_DREQ bit
     * - Direction:                                DMA_CTR2_SWREQ bit
     * - TriggerSelection:                         DMA_CTR2_TRIGSEL [21:16] bits
     * - Request:                                  DMA_CTR2_REQSEL [6:0] bits
     */
    pNode->LinkRegisters[reg_counter] = (DMA_InitNodeStruct->TransferEventMode | \
                                         DMA_InitNodeStruct->TriggerPolarity   | \
                                         DMA_InitNodeStruct->BlkHWRequest      | \
                                         DMA_InitNodeStruct->Mode              | \
                                         DMA_InitNodeStruct->Direction);

    /* Check direction */
    if (DMA_InitNodeStruct->Direction != LL_DMA_DIRECTION_MEMORY_TO_MEMORY)
    {
      pNode->LinkRegisters[reg_counter] |= DMA_InitNodeStruct->Request & DMA_CTR2_REQSEL;
    }

    /* Check trigger polarity */
    if (DMA_InitNodeStruct->TriggerPolarity != LL_DMA_TRIG_POLARITY_MASKED)
    {
      pNode->LinkRegisters[reg_counter] |= (((DMA_InitNodeStruct->TriggerSelection << DMA_CTR2_TRIGSEL_Pos) & \
                                             DMA_CTR2_TRIGSEL) | DMA_InitNodeStruct->TriggerMode);
    }


    /* Increment counter for the next register */
    reg_counter++;
  }

  /* Check if CBR1 register update is enabled */
  if ((DMA_InitNodeStruct->UpdateRegisters & LL_DMA_UPDATE_CBR1) == LL_DMA_UPDATE_CBR1)
  {
    /*-------------------------- DMAx CBR1 Configuration -----------------------
     * Configure the Transfer Block counters and update mode with parameter :
     * - BlkDataLength:                                 DMA_CBR1_BNDT[15:0] bits
     * - BlkRptCount:                                   DMA_CBR1_BRC[26:16] bits
     *   BlkRptCount field is supported only by 2D addressing channels.
     * - BlkRptSrcAddrUpdateMode:                              DMA_CBR1_BRSDEC bit
     *   BlkRptSrcAddrUpdateMode field is supported only by 2D addressing channels.
     * - BlkRptDestAddrUpdateMode:                             DMA_CBR1_BRDDEC bit
     *   BlkRptDestAddrUpdateMode field is supported only by 2D addressing channels.
     * - SrcAddrUpdateMode:                                    DMA_CBR1_SDEC bit
     *   SrcAddrUpdateMode field is supported only by 2D addressing channels.
     * - DestAddrUpdateMode:                                   DMA_CBR1_DDEC bit
     *   DestAddrUpdateMode field is supported only by 2D addressing channels.
     */
    pNode->LinkRegisters[reg_counter] = DMA_InitNodeStruct->BlkDataLength;

    /* Update CBR1 register fields for 2D addressing channels */
    if ((DMA_InitNodeStruct->NodeType == LL_DMA_HPDMA_2D_NODE) || \
        (DMA_InitNodeStruct->NodeType == LL_DMA_GPDMA_2D_NODE))
    {
      pNode->LinkRegisters[reg_counter] |= (DMA_InitNodeStruct->BlkRptDestAddrUpdateMode | \
                                            DMA_InitNodeStruct->BlkRptSrcAddrUpdateMode  | \
                                            DMA_InitNodeStruct->DestAddrUpdateMode       | \
                                            DMA_InitNodeStruct->SrcAddrUpdateMode        | \
                                            ((DMA_InitNodeStruct->BlkRptCount << DMA_CBR1_BRC_Pos) & DMA_CBR1_BRC));
    }

